In [2]:
%load_ext sql
%sql sqlite:///PS1.db

Problem Set 1 [75 points]
=======

### Deliverables:

Submit your queries (and only those) using the `submission_template.txt` file that is posted on the class website. Follow the instructions on the file! Upload the file at Canvas (under PS1).


### Instructions / Notes:

* Run the top cell above to load the database `PS1.db` (make sure the database file, `PS1.db`, is in the same directory as this IPython notebook is running in)
* Some of the problems involve _changing_ this database (e.g. deleting rows)- you can always re-download `PS1.db` or make a copy if you want to start fresh!
* You **may** create new IPython notebook cells to use for e.g. testing, debugging, exploring, etc.- this is encouraged in fact!- **just make sure that your final answer for each question is _in its own cell_ and _clearly indicated_**
* When you see `In [*]:` to the left of the cell you are executing, this means that the code / query is _running_.
    * **If the cell is hanging- i.e. running for too long: To restart the SQL connection, you must restart the entire python kernel**
    * To restart kernel using the menu bar: "Kernel >> Restart >> Clear all outputs & restart"), then re-execute the sql connection cell at top
    * You will also need to restart the connection if you want to load a different version of the database file
* Remember:
    * `%sql [SQL]` is for _single line_ SQL queries
    * `%%sql [SQL]` is for _multi line_ SQL queries
* _Have fun!_

Problem 1: Linear Algebra [25 points]
------------------------

Two random 3x3 ($N=3$) matrices have been provided in tables `A` and `B`, having the following schema:
> * `i INT`:   Row index
> * `j INT`:   Column index
> * `val INT`: Cell value

**Note: all of your answers below _must_ work for any _square_ matrix sizes, i.e. any value of $N$**.

Note how the matrices are represented - why do we choose this format?  Run the following queries to see the matrices in a nice format:

In [2]:
%sql SELECT group_concat(val, " , ") AS "A" FROM A GROUP BY i;

 * sqlite:///PS1.db
Done.

[('7 , 5 , 8',), ('10 , 7 , 7',), ('2 , 0 , 5',)]

In [3]:
%sql SELECT group_concat(val, " , ") AS "B" FROM B GROUP BY i;

 * sqlite:///PS1.db
Done.

[('9 , 6 , 10',), ('7 , 6 , 9',), ('1 , 1 , 7',)]

In [6]:
%%sql
select * from A

 * sqlite:///PS1.db
Done.

[(0, 0, 7),
 (0, 1, 5),
 (0, 2, 8),
 (1, 0, 10),
 (1, 1, 7),
 (1, 2, 7),
 (2, 0, 2),
 (2, 1, 0),
 (2, 2, 5)]

In [7]:
%%sql
select * from B

 * sqlite:///PS1.db
Done.

[(0, 0, 9),
 (0, 1, 6),
 (0, 2, 10),
 (1, 0, 7),
 (1, 1, 6),
 (1, 2, 9),
 (2, 0, 1),
 (2, 1, 1),
 (2, 2, 7)]

### Part (a): Matrix addition [5 points]

The sum of a matrix $A$ (having dimensions $n\times m$) and a matrix $B$ (having dimensions $n\times m$) is the matrix $C$ (of dimension $n\times m$) having cell at row $i$ and column $j$ equal to:

$C_{ij} = A_{ij} + B_{ij}$

Write a single SQL query to get the sum of $A$ and $B$ (in the same format as $A$ and $B$):

In [7]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

 * sqlite:///PS1.db
Done.

[(0, 0, 16),
 (0, 1, 11),
 (0, 2, 18),
 (1, 0, 17),
 (1, 1, 13),
 (1, 2, 16),
 (2, 0, 3),
 (2, 1, 1),
 (2, 2, 12)]

In [7]:
%%sql
select A.i, A.j, A.val+B.val val from A
join B on A.i=B.i and A.j=B.j

 * sqlite:///PS1.db
Done.

[(0, 0, 16),
 (0, 1, 11),
 (0, 2, 18),
 (1, 0, 17),
 (1, 1, 13),
 (1, 2, 16),
 (2, 0, 3),
 (2, 1, 1),
 (2, 2, 12)]

### Part (b): Dot product [5 points]

The _dot product_ of two vectors

$a = \begin{bmatrix}a_1 & a_2 & \dots & a_n\end{bmatrix}$

and

$b = \begin{bmatrix}b_1 & b_2 & \dots & b_n\end{bmatrix}$

is

$a\cdot b = \sum_{i=1}^n a_ib_i = a_1b_1 + a_2b_2 + \dots + a_nb_n$

Write a _single SQL query_ to take the dot product of the **third column of $A$** and the **second column of $B$.**:

In [8]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

 * sqlite:///PS1.db
Done.

[(95,)]

In [25]:
%%sql
select sum(A.val*B.val) DotProduct from A 
join B on A.i=B.i and A.j=2 and B.j=1

 * sqlite:///PS1.db
Done.

[(95,)]

In [ ]:
# [8 , 7 , 5] · [6 , 6 , 1]

In [19]:
%%sql
select A.i Ai, A.j Aj, B.i Bi, B.j Bj, A.val*B.val val, A.val Aval, B.val Bval from A 
join B on A.j=2 and B.j=1

 * sqlite:///PS1.db
Done.

[(0, 2, 0, 1, 48, 8, 6),
 (0, 2, 1, 1, 48, 8, 6),
 (0, 2, 2, 1, 8, 8, 1),
 (1, 2, 0, 1, 42, 7, 6),
 (1, 2, 1, 1, 42, 7, 6),
 (1, 2, 2, 1, 7, 7, 1),
 (2, 2, 0, 1, 30, 5, 6),
 (2, 2, 1, 1, 30, 5, 6),
 (2, 2, 2, 1, 5, 5, 1)]

### Part (c): Matrix multiplication [5 points]

The product of a matrix $A$ (having dimensions $n\times m$) and a matrix $B$ (having dimensions $m\times p$) is the matrix $C$ (of dimension $n\times p$) having cell at row $i$ and column $j$ equal to:

$C_{ij} = \sum_{k=1}^m A_{ik}B_{kj}$

In other words, to multiply two matrices, get each cell of the resulting matrix $C$, $C_{ij}$, by taking the _dot product_ of the $i$th row of $A$ and the $j$th column of $B$.

Write a single SQL query to get the matrix product of $A$ and $B$ (in the same format as $A$ and $B$):

In [7]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Done.

[(0, 0, 106),
 (0, 1, 80),
 (0, 2, 171),
 (1, 0, 146),
 (1, 1, 109),
 (1, 2, 212),
 (2, 0, 23),
 (2, 1, 17),
 (2, 2, 55)]

In [96]:
%%sql
select A.i, B.j, sum(A.val*B.val) val from A 
join B on A.j=B.i
group by A.i, B.j

 * sqlite:///PS1.db
Done.

[(0, 0, 106),
 (0, 1, 80),
 (0, 2, 171),
 (1, 0, 146),
 (1, 1, 109),
 (1, 2, 212),
 (2, 0, 23),
 (2, 1, 17),
 (2, 2, 55)]

In [71]:
%%sql
select A.i Ai, A.j Aj, B.i Bi, B.j Bj, sum(A.val*B.val) val, A.val Aval, B.val Bval from A 
join B on Ai=0 and Bj=0 and Aj=Bi
group by A.i, A.j, B.i, B.j

 * sqlite:///PS1.db
Done.

[(0, 0, 0, 0, 63, 7, 9), (0, 1, 1, 0, 35, 5, 7), (0, 2, 2, 0, 8, 8, 1)]

In [ ]:
106 = 7*9 + 5*7 + 8*1
AB00 = A00*B00 + A01*B10 + A02*B20

In [21]:
%%sql
select A.i Ai, sum(A.val*B.val) val from A 
join B on A.i=0 and B.j=0 and A.j=B.i
group by A.i

 * sqlite:///PS1.db
Done.

[(0, 106)]

In [14]:
%sql SELECT group_concat(val, " , ") AS "A" FROM A GROUP BY i;

 * sqlite:///PS1.db
Done.

[('7 , 5 , 8',), ('10 , 7 , 7',), ('2 , 0 , 5',)]

In [15]:
%sql SELECT group_concat(val, " , ") AS "B" FROM B GROUP BY i;

 * sqlite:///PS1.db
Done.

[('9 , 6 , 10',), ('7 , 6 , 9',), ('1 , 1 , 7',)]

### Part (d): Matrix power [10 points]

The power $A^n$ of a matrix $A$ is defined as the matrix product of $n$ copies of $A$. 

Write a _single SQL query_ that computes the **fourth power** of matrix $A$, in other words, $A^4 = A \cdot A \cdot A \cdot A$:

In [10]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

 * sqlite:///PS1.db
Done.

[(0, 0, 27149),
 (0, 1, 16290),
 (0, 2, 31916),
 (1, 0, 36892),
 (1, 1, 22221),
 (1, 2, 43134),
 (2, 0, 5284),
 (2, 1, 3080),
 (2, 2, 6465)]

In [32]:
%%sql
select A1.i, A2.j, sum(A1.val*A2.val) val 
from(select A1.i, A2.j, sum(A1.val*A2.val) val 
     from(
        select A1.i, A2.j, sum(A1.val*A2.val) val 
        from A A1 join A A2 on A1.j=A2.i
        group by A1.i, A2.j
        )A1 join A A2 on A1.j=A2.i
    group by A1.i, A2.j
)A1 join A A2 on A1.j=A2.i
group by A1.i, A2.j

 * sqlite:///PS1.db
Done.

[(0, 0, 27149),
 (0, 1, 16290),
 (0, 2, 31916),
 (1, 0, 36892),
 (1, 1, 22221),
 (1, 2, 43134),
 (2, 0, 5284),
 (2, 1, 3080),
 (2, 2, 6465)]

In [16]:
%sql SELECT group_concat(val, " , ") AS "A" FROM A GROUP BY i;

 * sqlite:///PS1.db
Done.

[('7 , 5 , 8',), ('10 , 7 , 7',), ('2 , 0 , 5',)]

In [17]:
%sql SELECT group_concat(val, " , ") AS "A" FROM A GROUP BY j;

 * sqlite:///PS1.db
Done.

[('7 , 10 , 2',), ('5 , 7 , 0',), ('8 , 7 , 5',)]

Problem 2: The Sales Database [25 points]
----------------------------------------------

We've prepared and loaded a dataset related to sales data from a company. The dataset has the following schema:

> `Holidays (WeekDate, IsHoliday)`

> `Stores (Store, Type, Size)`

> `TemporalData(Store, WeekDate, Temperature, FuelPrice, CPI, UnemploymentRate)`

> `Sales (Store, Dept, WeekDate, WeeklySales)`

Before you start writing queries on the database, find the schema and the constraints (keys, foreign keys).

### Part (a): Sales during Holidays [10 points]

Using a _single SQL query_, find the store(s) with the largest overall sales during holiday weeks. Further requirements:
* Use the `WITH` clause before the main body of the query to compute a subquery if necessary.
* Return a relation with schema `(Store, AllSales)`.

Write your query here:

In [42]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

 * sqlite:///PS1.db
Done.

[(20, 22490350.81000001)]

In [9]:
%%sql
select SH.store Store, sum(SH.AllSales) AllSales
from (
select S.store, S.weekdate, sum(S.weeklysales) AllSales 
from Sales S join Holidays H on S.weekdate=H.weekdate
where H.isholiday = "TRUE"
group by 1,2
)SH
group by 1
order by 2 desc
limit 1

 * sqlite:///PS1.db
Done.

[(20, 22490350.810000002)]

In [73]:
%%sql 
select store, weekdate, sum(weeklysales) from Sales 
where weekdate = '2010-02-05'
group by 1,2
limit 5

 * sqlite:///PS1.db
Done.

[(1, '2010-02-05', 1643690.9),
 (2, '2010-02-05', 2136989.46),
 (3, '2010-02-05', 461622.22),
 (4, '2010-02-05', 2135143.87),
 (5, '2010-02-05', 317173.0999999999)]

In [74]:
%%sql 
select * from Sales limit 5

 * sqlite:///PS1.db
Done.

[(1, 1, '2010-02-05', 24924.5),
 (1, 1, '2010-02-12', 46039.49),
 (1, 1, '2010-02-19', 41595.55),
 (1, 1, '2010-02-26', 19403.54),
 (1, 1, '2010-03-05', 21827.9)]

In [75]:
%%sql 
select * from Holidays limit 1

 * sqlite:///PS1.db
Done.

[('2010-02-05', 'FALSE')]

In [76]:
%%sql
select * from Stores limit 5

 * sqlite:///PS1.db
Done.

[(1, 'A', 151315),
 (2, 'A', 202307),
 (3, 'B', 37392),
 (4, 'A', 205863),
 (5, 'B', 34875)]

### Part (b): When Holidays do not help Sales [10 points]

Using a _single SQL query_, compute the **number** of non-holiday weeks that had larger sales than the overall average sales during holiday weeks. Further requirements:
* Use the `WITH` clause before the main body of the query to compute a subquery if necessary.
* Return a relation with schema `(NumNonHolidays)`.

Write your query here:

In [19]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Done.

[(8,)]

In [122]:
%%sql
select count(1) NumNonHolidays from(
    select S.weekdate, sum(S.weeklysales) AllSales
    from Sales S join Holidays H on S.weekdate=H.weekdate
    where H.isholiday = "FALSE"
    group by 1
    having AllSales>
    (
        select avg(AllSales) AvgSales 
        from(select S.weekdate, sum(S.weeklysales) AllSales
            from Sales S join Holidays H on S.weekdate=H.weekdate
            where H.isholiday = "TRUE"
            group by 1)
    )
)

 * sqlite:///PS1.db
Done.

[(8,)]

In [116]:
%%sql
select S.weekdate, sum(S.weeklysales) AllSales
from Sales S join Holidays H on S.weekdate=H.weekdate
where H.isholiday = "TRUE"
group by 1

 * sqlite:///PS1.db
Done.

[('2010-02-12', 48336677.63000006),
 ('2010-09-10', 45634397.840000056),
 ('2010-11-26', 65821003.240000084),
 ('2010-12-31', 40432519.000000075),
 ('2011-02-11', 47336192.78999979),
 ('2011-09-09', 46763227.53000005),
 ('2011-11-25', 66593605.25999993),
 ('2011-12-30', 46042461.03999984),
 ('2012-02-10', 50009407.91999999),
 ('2012-09-07', 48330059.30999995)]

In [114]:
%%sql
select avg(AllSales) AvgSales 
from(select S.weekdate, sum(S.weeklysales) AllSales
    from Sales S join Holidays H on S.weekdate=H.weekdate
    where H.isholiday = "TRUE"
    group by 1)

 * sqlite:///PS1.db
Done.

[(50529955.15599998,)]

In [119]:
%%sql
select S.weekdate, sum(S.weeklysales) AllSales
from Sales S join Holidays H on S.weekdate=H.weekdate
where H.isholiday = "FALSE"
group by 1
having AllSales>
(
select avg(AllSales) AvgSales 
from(select S.weekdate, sum(S.weeklysales) AllSales
    from Sales S join Holidays H on S.weekdate=H.weekdate
    where H.isholiday = "TRUE"
    group by 1)
)

 * sqlite:///PS1.db
Done.

[('2010-12-10', 55666770.389999814),
 ('2010-12-17', 61820799.85),
 ('2010-12-24', 80931415.60000007),
 ('2011-12-09', 55561147.70000017),
 ('2011-12-16', 60085695.93999998),
 ('2011-12-23', 76998241.30999984),
 ('2012-04-06', 53502315.87),
 ('2012-07-06', 51253021.87999992)]

### Part (c): Total Summer Sales [5 points]

Using a _single SQL query_, compute the total sales during summer (months 6,7,and 8) for each type of store. Further requirements:
* Return a relation with schema `(type, TotalSales)`.

*Hint:* SQLite3 does not support native operations on the DATE datatype. To create a workaround, you can use the `LIKE` predicate and the string concatenation operator (||). You can also use the substring operator that SQLite3 supports (`substr`).

Write your query here:

In [47]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

 * sqlite:///PS1.db
Done.

[('A', 1211554899.8500097),
 ('B', 561610722.3999932),
 ('C', 112555450.65999933)]

In [12]:
%%sql
select St.type, sum(Sa.weeklysales) weeklysales
from Stores St join Sales Sa on St.store=Sa.store
where weekdate like '%-06-%' or weekdate like '%-07-%' or weekdate like '%-08-%'
group by 1

 * sqlite:///PS1.db
Done.

[('A', 1211554899.8500097),
 ('B', 561610722.3999932),
 ('C', 112555450.65999933)]

In [6]:
%%sql
select St.type, sum(Sa.weeklysales) weeklysales
from Stores St join Sales Sa on St.store=Sa.store
group by 1

 * sqlite:///PS1.db
Done.

[('A', 4331014722.750051), ('B', 2000700736.8200703), ('C', 405503527.5399986)]

In [10]:
%%sql
select St.type, sum(Sa.weeklysales) weeklysales
from Stores St join Sales Sa on St.store=Sa.store
where weekdate like '%-06-%' or weekdate like '%-07-%' or weekdate like '%-08-%'
limit 5

 * sqlite:///PS1.db
Done.

[('A', 1, 1, '2010-06-04', 17558.09),
 ('A', 1, 1, '2010-06-11', 16637.62),
 ('A', 1, 1, '2010-06-18', 16216.27),
 ('A', 1, 1, '2010-06-25', 16328.72),
 ('A', 1, 1, '2010-07-02', 16333.14)]

Problem 3: The Traveling SQL Server Salesman Problem [25 points]
--------------------------------------------------

SQL Server salespeople are lucky as far as traveling salespeople go- they only have to sell one or two big enterprise contracts, at one or two offices in Wisconsin, in order to make their monthly quota!

Answer the following questions using the table of streets connecting company office buildings.

**Note that for convenience all streets are included _twice_, as $A \rightarrow B$ and $B \rightarrow A$.  This should make some parts of the problem easier, but remember to take it into account!**

In [13]:
%sql SELECT * FROM streets LIMIT 4;

 * sqlite:///PS1.db
Done.

[(0, 'F', 'UW-Madison', 'DooHickey Collective', 7),
 (0, 'R', 'DooHickey Collective', 'UW-Madison', 7),
 (1, 'F', 'DooHickey Collective', 'Gizmo Corp', 2),
 (1, 'R', 'Gizmo Corp', 'DooHickey Collective', 2)]

### Part (a): One-hop, two-hop, three-hop... [10 points]

Our salesperson has stopped at UW-Madison, to steal some cool new RDBMS technology from CS564-ers, and now wants to go sell it to a company _within 9 miles of UW-Madison and _passing through no more than 3 distinct streets_.  Write a single query, not using `WITH` (see later on), to find all such companies.

Your query should return the schema `(company, distance)` where distance is cumulative from UW-Madison.

Write your query here:

In [15]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

 * sqlite:///PS1.db
Done.

[('DooHickey Collective', 7),
 ('DooHickey Corp', 9),
 ('Gadget Collective', 9),
 ('Gadget Corp', 6),
 ('Gizmo Corp', 9)]

In [182]:
%%sql
SELECT B company, d distance FROM streets
where A='UW-Madison' and d<=9 
union
select X2.B company, x1.d+x2.d d12
from streets X1 join streets X2 on X1.B=X2.A and X1.direction = X2.direction
where X1.A = 'UW-Madison' and d12<=9

 * sqlite:///PS1.db
Done.

[('DooHickey Collective', 7),
 ('DooHickey Corp', 9),
 ('Gadget Collective', 9),
 ('Gadget Corp', 6),
 ('Gizmo Corp', 9)]

In [126]:
%sql SELECT * FROM streets LIMIT 4;

 * sqlite:///PS1.db
Done.

[(0, 'F', 'UW-Madison', 'DooHickey Collective', 7),
 (0, 'R', 'DooHickey Collective', 'UW-Madison', 7),
 (1, 'F', 'DooHickey Collective', 'Gizmo Corp', 2),
 (1, 'R', 'Gizmo Corp', 'DooHickey Collective', 2)]

In [175]:
%%sql
select X1.id, X1.direction, X1.A, X1.B, X1.d d1, X2.B C, x2.d d2, x1.d+x2.d d12, X3.B D, x3.d d3, x1.d+x2.d+x3.d distance
from streets X1 join streets X2 on X1.B=X2.A and X1.direction = X2.direction
join streets X3 on X2.B=X3.A and X1.direction = X3.direction
where X1.A = 'UW-Madison'
order by X1.direction, X1.id

 * sqlite:///PS1.db
Done.

[(0, 'F', 'UW-Madison', 'DooHickey Collective', 7, 'Gizmo Corp', 2, 9, 'GadgetWorks', 8, 17),
 (0, 'F', 'UW-Madison', 'DooHickey Collective', 7, 'Gizmo Corp', 2, 9, 'Widget Industries', 1, 10),
 (2, 'F', 'UW-Madison', 'Gadget Corp', 6, 'DooHickey Corp', 3, 9, 'DooHickeyWorks', 3, 12),
 (2, 'F', 'UW-Madison', 'Gadget Corp', 6, 'DooHickey Corp', 3, 9, 'ThingCo', 6, 15),
 (2, 'F', 'UW-Madison', 'Gadget Corp', 6, 'Gadget Industries', 9, 15, 'Widget Corp', 5, 20)]

In [179]:
%%sql
select X1.id, X1.direction, X1.A, X2.B C, x1.d+x2.d d12
from streets X1 join streets X2 on X1.B=X2.A and X1.direction = X2.direction
where X1.A = 'UW-Madison' and d12<=9 
order by X1.direction, X1.id

 * sqlite:///PS1.db
Done.

[(0, 'F', 'UW-Madison', 'Gizmo Corp', 9),
 (2, 'F', 'UW-Madison', 'DooHickey Corp', 9)]

In [171]:
%%sql
SELECT * FROM streets
where A='UW-Madison' and d<=9

 * sqlite:///PS1.db
Done.

[(0, 'F', 'UW-Madison', 'DooHickey Collective', 7),
 (2, 'F', 'UW-Madison', 'Gadget Corp', 6),
 (5, 'F', 'UW-Madison', 'Gadget Collective', 9)]

### Part (b): A stop at the Farm [10 points]

Now, our salesperson is out in the field, and wants to see all routes- and their distances- which will take him/her from a company $A$ to a company $B$, with the following constraints:
* The route must pass through UW-Madison (in order to pick up new RDBMS tech to sell!)
* $A$ and $B$ must _each individually_ be within 2 hops of UW-Madison
* $A$ and $B$ must be different companies
* _The total distance must be $<= 15$_
* Do not use `WITH`
* If you return a path $A \rightarrow B$, _do not include_ $B \rightarrow A$ in your answer!

In order to make your answer a bit cleaner, you may split into two queries, one of which creates a `VIEW`.  A view is a virtual table based on the output set of a SQL query.  A view can be used just like a normal table- the only difference under the hood is that the DBMS re-evaluates the query used to generate it each time a view is queried by a user (thus the data is always up-to date!)

Here's a simple example of a view:

In [16]:
%%sql 
DROP VIEW IF EXISTS short_streets;
CREATE VIEW short_streets AS 
SELECT A, B, d FROM streets WHERE d < 3;
SELECT * FROM short_streets LIMIT 3;

 * sqlite:///PS1.db
Done.
Done.
Done.

[('DooHickey Collective', 'Gizmo Corp', 2),
 ('Gizmo Corp', 'DooHickey Collective', 2),
 ('Gizmo Corp', 'Widget Industries', 1)]

Write your query or queries here:

In [33]:

"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

 * sqlite:///PS1.db
Done.
Done.
Done.

[('Gadget Corp', 'DooHickey Collective', 13),
 ('Gadget Corp', 'DooHickey Corp', 15),
 ('Gadget Corp', 'Gadget Collective', 15),
 ('Gizmo Corp', 'Gadget Corp', 15)]

In [13]:
%%sql 
DROP VIEW IF EXISTS short_streets;
CREATE VIEW short_streets AS 
SELECT A, B, d FROM streets WHERE d < 3;
SELECT * FROM short_streets LIMIT 3;

 * sqlite:///PS1.db
Done.
Done.
Done.

[('DooHickey Collective', 'Gizmo Corp', 2),
 ('Gizmo Corp', 'DooHickey Collective', 2),
 ('Gizmo Corp', 'Widget Industries', 1)]

In [200]:
%%sql
DROP VIEW IF EXISTS F;
CREATE VIEW F AS 
SELECT id path, A U, B company, d FROM streets
where A='UW-Madison' and d<=15 
union
select X2.id, X1.A, X2.B company, x1.d+x2.d d12
from streets X1 join streets X2 on X1.B=X2.A and X1.direction = X2.direction
where X1.A = 'UW-Madison' and d12<=15;
SELECT * FROM F;

 * sqlite:///PS1.db
Done.
Done.
Done.

[(0, 'UW-Madison', 'DooHickey Collective', 7),
 (1, 'UW-Madison', 'Gizmo Corp', 9),
 (2, 'UW-Madison', 'Gadget Corp', 6),
 (3, 'UW-Madison', 'DooHickey Corp', 9),
 (5, 'UW-Madison', 'Gadget Collective', 9),
 (7, 'UW-Madison', 'Gadget Industries', 15),
 (11, 'UW-Madison', 'GizmoWorks', 12)]

In [199]:
%%sql
DROP VIEW IF EXISTS R;
CREATE VIEW R AS 
SELECT id path, A company, B U, d FROM streets
where B='UW-Madison' and d<=15 
union
select X1.id, X2.A company, X1.B, x1.d+x2.d d12
from streets X1 join streets X2 on X1.A=X2.B and X1.direction = X2.direction
where X1.B = 'UW-Madison' and d12<=15;
SELECT * FROM R;

 * sqlite:///PS1.db
Done.
Done.
Done.

[(0, 'DooHickey Collective', 'UW-Madison', 7),
 (0, 'Gizmo Corp', 'UW-Madison', 9),
 (2, 'DooHickey Corp', 'UW-Madison', 9),
 (2, 'Gadget Corp', 'UW-Madison', 6),
 (2, 'Gadget Industries', 'UW-Madison', 15),
 (5, 'Gadget Collective', 'UW-Madison', 9),
 (5, 'GizmoWorks', 'UW-Madison', 12)]

In [203]:
%%sql
select F.company company_1, R.company company_2, F.d+R.d distance
from F join R on F.U = R.U and F.path>R.path
where distance<=15 and company_1!=company_2

 * sqlite:///PS1.db
Done.

[('Gadget Corp', 'DooHickey Collective', 13),
 ('Gadget Corp', 'Gizmo Corp', 15),
 ('DooHickey Corp', 'Gadget Corp', 15),
 ('Gadget Collective', 'Gadget Corp', 15)]

In [47]:
%%sql
select F.direction, f.company company_1, F.A School, R.company company_2, F.d+R.d distance 
from(SELECT direction, A, B company, d FROM streets
    where A='UW-Madison' and d<=15 
    union
    select X1.direction, X1.A, X2.B company, x1.d+x2.d d12
    from streets X1 join streets X2 on X1.B=X2.A and X1.direction = X2.direction
    where X1.A = 'UW-Madison' and d12<=15 
)F join (SELECT direction, A company, B, d FROM streets
    where B='UW-Madison' and d<=15 
    union
    select X1.direction, X2.A company, X1.B, x1.d+x2.d d12
    from streets X1 join streets X2 on X1.A=X2.B and X1.direction = X2.direction
    where X1.B = 'UW-Madison' and d12<=15
)R on F.A = R.B
where distance<=15 and company_1!=company_2

 * sqlite:///PS1.db
Done.

[('F', 'DooHickey Collective', 'UW-Madison', 'Gadget Corp', 13),
 ('F', 'DooHickey Corp', 'UW-Madison', 'Gadget Corp', 15),
 ('F', 'Gadget Collective', 'UW-Madison', 'Gadget Corp', 15),
 ('F', 'Gadget Corp', 'UW-Madison', 'DooHickey Collective', 13),
 ('F', 'Gadget Corp', 'UW-Madison', 'DooHickey Corp', 15),
 ('F', 'Gadget Corp', 'UW-Madison', 'Gadget Collective', 15),
 ('F', 'Gadget Corp', 'UW-Madison', 'Gizmo Corp', 15),
 ('F', 'Gizmo Corp', 'UW-Madison', 'Gadget Corp', 15)]

### Part (c): Finding Triangles [5 points]

Finally, our salesperson wants to find a route that goes from company $A$ to company $B$ to company $C$ and then back to company $A$ with the following constraints:
* $A$, $B$, $C$ must be different companies
* Do not use `WITH` 
* Output each such route that you find once (use the id's as a way to break ties)
* Output the distance of the route

Write your query here:

In [39]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

 * sqlite:///PS1.db
Done.

[('Thing Industries', 'Widget Collective', 'GadgetCo', 18)]

In [244]:
%%sql
select X1.A, X1.B, X2.B C, (x1.d+x2.d)*2 d
from streets X1 join streets X2 on X1.B=X2.A
join streets X3 on X2.B=X3.A and X1.A=X3.B
where X1.A != 'UW-Madison' and X2.A != 'UW-Madison' and X2.B != 'UW-Madison'
and X1.A != X2.B
and X1.id < X2.id
and X1.id < X3.id
and X2.id < X3.id

 * sqlite:///PS1.db
Done.

[('Thing Industries', 'Widget Collective', 'GadgetCo', 18)]